/*

  •__________________________________________•
  |  Картинка с наглядной   |                |
  |  распиновкой двигателей |                |
  |-——————————————|                |
  |                                          |
  |                  ПЕРЕД                   |
  |             |=============|              |
  | A0|--=[ 9]==|             |==[13]=--|A2  |
  |             |             |              |
  |             |   _  _  _   |              |
  | A0|--=[ 8]==|  | || || |  |==[12]=--|A2  |
  |             |  | |[5]| |  |              |
  |             |  | || || |  |              |
  | A1|--=[ 7]==|  `Y´`Y´`Y´  |==[11]=--|A3  |
  |             |   •  •  •   |              |
  |             |             |              |
  | A1|--=[ 6]==|     ЗАД     |==[10]=--|A3  |
  |             |=============|              |
  |                                          |
  |                                          |
  •¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯•
*/



#define BODY 5  // Пин двигателя продольного смещения

// герконы ради экономии места соединяются по несколько штук в один пин через разные резисторы
#define LEFT_F A0   // два левых передних геркона
#define LEFT_B A1   // два левых задних
#define RIGHT_F A2  // два правых передних
#define RIGHT_B A3  // два правых задних

// Распиновка актуаторов, начиная с задних, заканчивая передними
const int leftLegs = [6, 7, 8, 9];          // Левый ряд
const int rightLegs = [10, 11, 12, 13];     // Правый ряд 


////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////

void setup() 
{
    Serial.begin(9600);

    // Указываем выходные пины
    for(int i = 0; i < 4; i++)
    {
        pinMode(leftLegs[i], OUTPUT);
        pinMode(rightLegs[i], OUTPUT);
    }
    pinMode(BODY, OUTPUT);
}

void loop() 
{
    if(Serial.available())
    {
        char cmd = Serial.read();
        byte value = Serial.read();
    }
}
